### SQL-Based Analysis of Product Sales

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect("Chinook_Sqlite.sqlite") #conncetion
cursor = con.cursor()  #cursor Object

In [6]:
cursor.execute('SELECT name FROM sqlite_master WHERE type="table";')
table = cursor.fetchall()
table

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

##  Answer key business questions: 
1) Top-selling products
2) Revenue per region
3) Monthly performance

### Top-selling products

In [75]:
track = """SELECT t.Name AS Track_Name, COUNT(il.Quantity) AS Total_Quantity_Sold 
        FROM InvoiceLine il JOIN Track t ON il.Trackid = t.Trackid 
        GROUP BY il.trackid 
        ORDER BY Total_Quantity_Sold DESC LIMIT 10;"""
track_prod = pd.read_sql_query(track,con)
print(track_prod)

                  Track_Name  Total_Quantity_Sold
0          Balls to the Wall                    2
1           Inject The Venom                    2
2                 Snowballed                    2
3                   Overdose                    2
4            Deuces Are Wild                    2
5             Not The Doctor                    2
6          Por Causa De Você                    2
7  Welcome Home (Sanitarium)                    2
8                  Snowblind                    2
9                 Cornucopia                    2

## Revenue per region

In [8]:
rev_region = """SELECT c.Country, SUM(i.Total) AS Total_Revenu_By_Region 
                FROM CUSTOMER c 
                JOIN Invoice i ON i.Customerid = c.Customerid 
                GROUP BY Country ORDER BY Total_Revenu_By_Region DESC """

revenue = pd.read_sql_query(rev_region,con)
revenue

           Country  Total_Revenu_By_Region
0              USA                  523.06
1           Canada                  303.96
2           France                  195.10
3           Brazil                  190.10
4          Germany                  156.48
5   United Kingdom                  112.86
6   Czech Republic                   90.24
7         Portugal                   77.24
8            India                   75.26
9            Chile                   46.62
10         Ireland                   45.62
11         Hungary                   45.62
12         Austria                   42.62
13         Finland                   41.62
14     Netherlands                   40.62
15          Norway                   39.62
16          Sweden                   38.62
17           Spain                   37.62
18          Poland                   37.62
19           Italy                   37.62
20         Denmark                   37.62
21         Belgium                   37.62
22       Australia                   37.62
23       Argentina                   37.62

##  Monthly performance

In [58]:
perf = '''Select strftime("%Y",i.InvoiceDate) AS Year, 
            strftime("%m",i.InvoiceDate) AS Month,
            Sum(il.UnitPrice * il.Quantity) AS  Monthly_Revenu 
            FROM InvoiceLine il 
            JOIN Invoice i ON i.InvoiceId = il.InvoiceId 
            GROUP BY Year,Month ORDER BY Year,Month;'''
month_num_map = {
    '01': 'January', '02': 'February', '03': 'March',
    '04': 'April', '05': 'May', '06': 'June',
    '07': 'July', '08': 'August', '09': 'September',
    '10': 'October', '11': 'November', '12': 'December'
    }
monthly_perf = pd.read_sql_query(perf,con)
monthly_perf["Month"]= monthly_perf["Month"].map(month_num_map)
monthly_perf

    Year      Month  Monthly_Revenu
0   2009    January           35.64
1   2009   February           37.62
2   2009      March           37.62
3   2009      April           37.62
4   2009        May           37.62
5   2009       June           37.62
6   2009       July           37.62
7   2009     August           37.62
8   2009  September           37.62
9   2009    October           37.62
10  2009   November           37.62
11  2009   December           37.62
12  2010    January           52.62
13  2010   February           46.62
14  2010      March           44.62
15  2010      April           37.62
16  2010        May           37.62
17  2010       June           37.62
18  2010       July           37.62
19  2010     August           37.62
20  2010  September           36.63
21  2010    October           37.62
22  2010   November           37.62
23  2010   December           37.62
24  2011    January           37.62
25  2011   February           37.62
26  2011      March           37.62
27  2011      April           51.62
28  2011        May           42.62
29  2011       June           50.62
30  2011       July           37.62
31  2011     August           37.62
32  2011  September           37.62
33  2011    October           37.62
34  2011   November           23.76
35  2011   December           37.62
36  2012    January           37.62
37  2012   February           37.62
38  2012      March           37.62
39  2012      April           37.62
40  2012        May           37.62
41  2012       June           37.62
42  2012       July           39.62
43  2012     August           47.62
44  2012  September           46.71
45  2012    October           42.62
46  2012   November           37.62
47  2012   December           37.62
48  2013    January           37.62
49  2013   February           27.72
50  2013      March           37.62
51  2013      April           33.66
52  2013        May           37.62
53  2013       June           37.62
54  2013       July           37.62
55  2013     August           37.62
56  2013  September           37.62
57  2013    October           37.62
58  2013   November           49.62
59  2013   December           38.62

### CustomerRevenue By using WindowFunction

In [73]:
query = """WITH CustomerRevenue AS (
    SELECT c.Country, c.CustomerId, 
    concat(c.FirstName," ",c.LastName) AS CustomerName,
    sum(il.UnitPrice * il.Quantity) AS TotalRevenue
    FROM Customer c
    JOIN Invoice i ON c.CustomerId = i.CustomerId
    JOIN InvoiceLine il ON i.InvoiceId = il.InvoiceId
    GROUP BY c.Country, c.CustomerId
),
RankedCustomers AS (
    SELECT *,
    RANK() OVER (PARTITION BY Country ORDER BY TotalRevenue DESC) AS Revenue_Rank,
    ROW_NUMBER() OVER (PARTITION BY Country ORDER BY TotalRevenue DESC) AS Row_Num
    FROM CustomerRevenue
)
SELECT *
FROM RankedCustomers
where Revenue_Rank=1 and Row_Num = 1
ORDER BY Country;

"""

window_func = pd.read_sql_query(query,con)
window_func

,Country,CustomerId,CustomerName,TotalRevenue,Revenue_Rank,Row_Num
0,Argentina,56,Diego Gutiérrez,37.62,1,1
1,Australia,55,Mark Taylor,37.62,1,1
2,Austria,7,Astrid Gruber,42.62,1,1
3,Belgium,8,Daan Peeters,37.62,1,1
4,Brazil,1,Luís Gonçalves,39.62,1,1
5,Canada,3,François Tremblay,39.62,1,1
6,Chile,57,Luis Rojas,46.62,1,1
7,Czech Republic,6,Helena Holý,49.62,1,1
8,Denmark,9,Kara Nielsen,37.62,1,1
9,Finland,44,Terhi Hämäläinen,41.62,1,1
10,France,43,Isabelle Mercier,40.62,1,1
11,Germany,37,Fynn Zimmermann,43.62,1,1
12,Hungary,45,Ladislav Kovács,45.62,1,1
13,India,58,Manoj Pareek,38.62,1,1
14,Ireland,46,Hugh O'Reilly,45.62,1,1
15,Italy,47,Lucas Mancini,37.62,1,1
16,Netherlands,48,Johannes Van der Berg,40.62,1,1
17,Norway,4,Bjørn Hansen,39.62,1,1
18,Poland,49,Stanisław Wójcik,37.62,1,1
19,Portugal,34,João Fernandes,39.62,1,1
20,Spain,50,Enrique Muñoz,37.62,1,1
21,Sweden,51,Joakim Johansson,38.62,1,1
22,USA,26,Richard Cunningham,47.62,1,1
23,United Kingdom,52,Emma Jones,37.62,1,1